ИНТЕРАКТИВНЫЙ ТРЕНАЖЕР ПО SQL (stepik.org)  
(Дальневосточный федеральный университет)

1. Основы Реляционной Модели и SQL

In [ ]:
# LESSON 1. Отношение (таблица)

In [ ]:
# Типы данных:
# INTEGER (INT) -- Целое число, могут принимать значения от -2147483648 до 2147483647

# DECIMAL (4, 1) -- Вещественное число, в скобках указывается максимальная
# длина числа (включает символы слева и справа от десятичной запятой) 
# и количество знаков после запятой. Принимают значения в диапазоне -10^38+1 до 10^38-1.

# NUMERIC(6,3) -- аналогично DECIMAL

# DATE -- дата в формате YYYY-MM-DD

# VARCHAR(20) -- Строка длиной не более 255 символов, в скобках указывается максимальная 
# длина строки

In [ ]:
# Для описания ключевого поля используйте описание:
INT PRIMARY KEY AUTO_INCREMENT

In [ ]:
# Task 1
# Сформулируйте SQL запрос для создания таблицы book
CREATE TABLE book (
  book_id INT PRIMARY KEY AUTO_INCREMENT, 
  title VARCHAR(50), 
  author VARCHAR(30), 
  price DECIMAL(8, 2), 
  amount INT
);

In [ ]:
# to comment a block of code in SQL use: /* some text */
# to comment a block of code till the end of the line in SQL use: -- some text

In [ ]:
# Task 2
# Занесите новую строку в таблицу book 
INSERT INTO book (title, author, price, amount) 
VALUES 
  (
    "Мастер и Маргарита", 
    "Булгаков М.А.", 
    670.99, 
    3
  );

In [ ]:
# Task 3
# Занесите еще три записи в таблицу book. Каждая строка вставляется отдельным SQL 
# запросом, запросы обязательно разделять точкой с запятой
INSERT INTO book (title, author, price, amount) 
VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 5);
  
INSERT INTO book (title, author, price, amount) 
VALUES ('Идиот', 'Достоевский Ф.М.', 460.00, 10);
  
INSERT INTO book (title, author, price, amount) 
VALUES ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);

In [ ]:
# LESSON 2. Выборка данных

In [ ]:
# В окне кода можно использовать комментарии для сохранения разных 
# вариантов запросов или пояснений. Комментарии заключаются в /* и */

In [ ]:
# Task 1
# Вывести информацию о всех книгах, хранящихся на складе. 
SELECT 
  * 
FROM 
  book;

In [ ]:
# Task 2
# Выбрать авторов, название книг и их цену из таблицы book.
SELECT 
  author, 
  title, 
  price 
FROM 
  book;

In [ ]:
# Task 3
# Выбрать названия книг и авторов из таблицы book, 
# для поля title задать новое имя Название, для поля author –  Автор.
SELECT 
  title AS 'Название', 
  author AS 'Автор' 
FROM 
  book;

In [ ]:
# Task 4
# Для упаковки каждой книги требуется 1 лист бумаги, 
# цена которого 1 рубль 65 копеек. 
# Посчитать стоимость упаковки для каждой книги 
# (сколько денег потребуется, чтобы упаковать все экземпляры книги). 
# В запросе вывести название книги, ее количество и стоимость упаковки, 
# последний столбец назвать pack.
SELECT 
  title, 
  amount, 
  amount * 1.65 AS pack 
FROM 
  book;

In [ ]:
# В SQL реализовано множество  математических функций для работы 
# с числовыми данными.Некоторые из них.

# CEILING(x) -- возвращает наименьшее число, большее или равное Х

# ROUND(x, k) -- округляет значение Х до К знаков после запятой,
#                если К не указано, Х округляется до целого

# FLOOR(x) -- возвращает наибольшее целое число, меньшее или равное Х
#             floor(4.2)=4; floor(-5.8)=-6

# POWER(x, y) -- возведение Х в степень У

# SQRT(X) -- квадратный корень из Х

# DEGREES(x) -- конвертирует значение Х из радианы в градусы

# RADIANS(x) -- конвертирует значение Х из градусов в радианы

# ABS(x) -- модуль числа Х

# PI() -- число pi = 3.1415926..

In [ ]:
# Task 5
# В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. 
# Написать SQL запрос, который из таблицы book выбирает 
# названия, авторов, количества и вычисляет новые цены книг. 
# Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков 
# после запятой.
SELECT 
  title, 
  author, 
  amount, 
  ROUND(price * 0.7, 2) AS new_price 
FROM 
  book;

In [ ]:
# В SQL реализована возможность заносить в поле значение 
# в зависимости от условия:
# IF(логическое_выражение, выражение_1, выражение_2)

# Допускается использование вложенных функций, вместо выражения_1 
# или выражения_2 может стоять новая функция IF.

In [ ]:
# Example:
# Вычисление скидки в зависимости от количества книг. 
# Если количество книг меньше 4 – то скидка 50%, меньше 11 – 30%, 
# в остальных случаях – 10%. 
# И еще укажем какая именно скидка на каждую книгу.
SELECT 
  title, 
  amount, 
  price, 
  round(
    IF(
      amount < 4, 
      price * 0.5, 
      IF(amount < 11, price * 0.7, price * 0.9)
    ), 
    2
  ) AS sale, 
  IF(
    amount < 4, 
    'скидка 50%', 
    IF(
      amount < 11, 'скидка 30%', 'скидка 10%'
    )
  ) AS Ваша_скидка 
FROM 
  book;

In [ ]:
# Task 6
# При анализе продаж книг выяснилось, что наибольшей популярностью пользуются
# книги Михаила Булгакова, на втором месте книги Сергея Есенина.
# Исходя из этого решили поднять цену книг Булгакова на 10%, 
# а цену книг Есенина - на 5%. Написать запрос, куда включить автора, 
# название книги и новую цену, последний столбец назвать new_price. 
# Значение округлить до двух знаков после запятой.
SELECT 
  author, 
  title, 
  round(
    IF(
      author = 'Булгаков М.А.', 
      price * 1.1, 
      IF(
        author = 'Есенин С.А.', price * 1.05, 
        price
      )
    ), 
    2
  ) AS new_price 
FROM 
  book;

In [ ]:
# WHERE
# Логическое выражение может включать операторы сравнения:
# равно «=», 
# не равно «<>», 
# больше «>», 
# меньше «<», 
# больше или равно«>=», 
# меньше или равно «<=») 
# и выражения, допустимые в SQL.

# В логическом выражении после WHERE нельзя использовать названия столбцов,
# присвоенные им с помощью AS

In [ ]:
# Task 7
# Вывести автора, название  и цены тех книг, количество которых меньше 10.
SELECT 
  author, 
  title, 
  price 
FROM 
  book 
WHERE 
  amount < 10;

In [ ]:
# Логическое выражение после ключевого слова WHERE 
# кроме операторов сравненияи выражений может включать логические операции 
# (И «and», ИЛИ «or», НЕ «not») и круглые скобки, 
# изменяющие приоритеты выполнения операций.

In [ ]:
# Приоритеты операций:
# -- круглые скобки
# -- умножение  (*),  деление (/)
# -- сложение  (+), вычитание (-)
# -- операторы сравнения (=, >, <, >=, <=, <>)
# -- NOT
# -- AND
# -- OR

In [ ]:
# Task 8
# Вывести название, автора,  цену  и количество всех книг, 
# цена которых меньше 500 или больше 600, 
# а стоимость всех экземпляров этих книг больше или равна 5000.
SELECT 
  title, 
  author, 
  price, 
  amount 
FROM 
  book 
WHERE 
  (
    price < 500 
    OR price > 600
  ) 
  AND price * amount >= 5000;

In [ ]:
# Логическое выражение после ключевого слова WHERE может включать операторы
# BETWEEN и IN. Эти операторы имеют самый низкий приоритет (как  OR).

# Example (BETWEEN - интервал включая его границы):
SELECT title, amount 
FROM book
WHERE amount BETWEEN 5 AND 14;

# Example (IN):
SELECT title, price 
FROM book
WHERE author IN ('Булгаков М.А.', 'Достоевский Ф.М.');

In [ ]:
# Task 9
# Вывести название и авторов тех книг, 
# цены которых принадлежат интервалу от 540.50 до 800 (включая границы),  
# а количество или 2, или 3, или 5, или 7.
SELECT 
  title, 
  author 
FROM 
  book 
WHERE 
  (
    price BETWEEN 540.50 
    AND 800
  ) 
  AND amount IN (2, 3, 5, 7);

In [ ]:
# Оператор LIKE используется для сравнения строк. 
# В отличие от операторов отношения равно (=) и не равно (<>), 
# LIKE позволяет сравнивать строки не на полное совпадение (не совпадение), 
# а в соответствии с шаблоном. 
# Шаблон может включать обычные символы и символы-шаблоны:
# % -- Любая строка, содержащая ноль или более символов
# _ -- Любой одиночный символ

# Example:
# выполняет поиск и выдает все книги, инициалы авторов которых содержат «М.»
SELECT * FROM book WHERE author LIKE '%М.%'; 

# Example:
# выполняет выдает книги, названия которых либо «Поэма», либо «Поэмы» и пр.
SELECT * FROM book WHERE title LIKE 'Поэм_'; 

# Example:
# Вывести название книг, состоящих ровно из 5 букв.
SELECT title FROM book 
WHERE title LIKE "_____"

# Example:
# Вывести книги, название которых длиннее 5 символов:
SELECT title FROM book 
WHERE title LIKE "______%";
# эквивалентные условия 
# title LIKE "%______"
# title LIKE "%______%"

# Example:
# Вывести названия книг, которые состоят ровно из одного слова, 
# если считать, что слова в названии отделяются друг от друга пробелами .
SELECT title FROM book 
WHERE title NOT LIKE "% %";    


# NB! Строчные и прописные буквы в строках эквивалентны.

In [ ]:
# Task 10
# Вывести название и автора тех книг, название которых состоит из двух и более
# слов, а инициалы автора содержат букву «С». 
# Считать, что в названии слова отделяются друг от друга пробелами и 
# не содержат знаков препинания, между фамилией автора и инициалами 
# обязателен пробел, инициалы записываются без пробела в формате: 
# буква, точка, буква, точка.
SELECT 
  title, 
  author 
FROM 
  book 
WHERE 
  title LIKE '_% _%' 
  AND author LIKE '%С.%';

In [ ]:
# При выборке можно указывать столбец или несколько столбцов, 
# по которым необходимо отсортировать отобранные строки. 
# Для этого используются ключевые слова ORDER BY, 
# после которых задаются имена столбцов. 

# По умолчанию ORDER BY выполняет сортировку по возрастанию. 
# Чтобы управлять направлением сортировки вручную, 
# после имени столбца указывается ключевое слово ASC (по возрастанию) 
# или DESC (по убыванию). 

# Example
# Вывести автора, название и количество книг, 
# в отсортированном в алфавитном порядке по автору и по убыванию количества,
# для тех книг, цены которых меньше 750 рублей.
SELECT author, title, amount AS Количество
FROM book
WHERE price < 750
ORDER BY author, amount DESC;

In [ ]:
# Task 11
# Вывести  автора и название  книг, количество которых принадлежит 
# интервалу от 2 до 14 (включая границы). 
# Информацию  отсортировать по авторам (в обратном алфавитном порядке) 
# и названиям (по алфавиту).
SELECT 
  author, 
  title 
FROM 
  book 
WHERE 
  amount BETWEEN 2 
  AND 14 
ORDER BY 
  author DESC, 
  title;

In [ ]:
# Task 12
# Your own query
SELECT 
  author, 
  title, 
  price * amount AS inventory_price 
FROM 
  book 
WHERE 
  price * amount BETWEEN 2000 
  AND 4000 
ORDER BY 
  inventory_price DESC;

In [ ]:
# LESSON 3. Запросы, групповые операции

In [ ]:
# Task 1